package Home_task;

public class Task46 {
    public static void main(String[] args) {/* Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.*/
        for (int i = 10; i <= 20; i++) {
            System.out.print((int) (Math.pow(i, 2)) + " ");
        }
    }
}
